// PHP tasks
// Task 1
//عمل برنامج حاسبة لأداء العمليات الحسابية البسيطة
$num1 = 7;
$num2 = 8;
$opr ='+';
---------------------------------------------------------------------
// Task 2 
//الاجابة على الاسئلة التالية 

for ( $j = 0;  $j <  5; $j++ ){
  echo $j . " ";
}//ماهو ناتج الطباعة
a) 0 1 2 3 4 5
b) 0 1 2 3 4  <--
c) 0 1 2 3 4 5
d) j j j j j
//
for ( $j = 5;  $j > -5; $j-- )
  echo $j . " " ;
//ماهو ناتج الطباعة
a) -5 -4 -3 -2 -1 0
b) 5 4 3 2 1 0
c) 5 4 3 2 1 0 -1 -2 -3 -4 -5
d) 5 4 3 2 1 0 -1 -2 -3 -4
-------------------------------------------------------------------
// Task 3
قم بجمع اصغر واكبر رقم في المصفوفة arrayبأستخدام ما تعلمته حول موضوع ال
$arr = array(12,26,34,28,19,37,9);

// Task 4
قم بطباعة القيم الموجودة في منتصف المصفوفة arrayبأستخدام ما تعلمته حول موضوع ال
$arr = array("php","java","html","css","python","json");
-------------------------------------------------------------------
"php" مع "java"قم بتغير اماكن  الكلمات Stringبأستخدام ما تعلمته حول موضوع ال
$str = "compare betwen php and another lang java";