// PHP tasks
// Task 1
//عمل برنامج حاسبة لأداء العمليات الحسابية البسيطة
$num1 = 7;
$num2 = 8;
$opr ='+';

<?php
 function sum($n1, $n2)
{
return $n1+ $n2;
}

 function mul($n1, $n2)
{
return $n1* $n2;
}

 function sub($n1, $n2)
{
return $n1- $n2;
}

 function div($n1, $n2)
{
return $n1/ $n2;
}
دوال لاداء العمليات الحسابيه 

?>

// Task 2 
//الاجابة على الاسئلة التالية 

for ( $j = 0;  $j <  5; $j++ ){
  echo $j . " ";
}//ماهو ناتج الطباعة
a) 0 1 2 3 4 5
b) 0 1 2 3 4  <--
c) 0 1 2 3 4 5
d) j j j j j
                      الناتج هو b
/////////////////////////////////
for ( $j = 5;  $j > -5; $j-- )
  echo $j . " " ;
//ماهو ناتج الطباعة
a) -5 -4 -3 -2 -1 0
b) 5 4 3 2 1 0
c) 5 4 3 2 1 0 -1 -2 -3 -4 -5
d) 5 4 3 2 1 0 -1 -2 -3 -4   <--
                                 الاجابه هي d 
